#pragma once
#include <string>
#include <vector>
#include <map>
#include <memory>
#include "mcpe/tile/TileTypeEnum.h"
#include "mcpe/tile/RenderLayerEnum.h"
#include "mcpe/tileentity/TileEntityTypeEnum.h"
#include "mcpe/tile/TileID.h"
class LevelSettings;
class Level;
class TileEntity;
class ChestTileEntity;
class FurnaceTileEntity;
class ItemEntity;
class ChunkSource;
class TileSource;
class TextureAtlasTextureItem;
class MinecraftClient;
class IntRectangle;
class CompoundTag;
class EntityPos;
class Player;
class ChunkPos;
class Mob;
class Item;
class LocalPlayer;
class ServerCommandParser;
class Font;
class Random;
class TilePos;
class ItemInstance;
class LevelChunk;
class Color;
class Entity;
class Vec3;
class EntityDamageSource;
class Brightness;
class PacketSender;
class Vec2;
class MobEffect;
class MobEffectInstance;
class EntityLink;
class RakNet {
public:
	class RakNetGUID;
};

enum TextureFile {
	FILE_TERRAIN,
	FILE_ITEM
};

class TextureAtlas {
public:
	TextureAtlas(const std::string &, TextureFile);
	TextureAtlasTextureItem getTextureItem(const std::string &) const;
	void load(MinecraftClient *);
};

class TextureUVCoordinateSet {
public:
	float minU;		// 0
	float minV;		// 4
	float maxU;			// 8
	float maxV;			// 12
	float width;		// 16
	float height;		// 20
	int i1;				// 24
	TextureFile type;	// 28
public:
	TextureUVCoordinateSet(float, float, float, float, float, float, int, TextureFile);
	TextureUVCoordinateSet();
	void fix();
};

class TextureAtlasTextureItem {
public:
	std::string _name;
	int _uvCount;
	std::vector<TextureUVCoordinateSet> _textureUVs;
public:
	TextureAtlasTextureItem(std::string const&, std::vector<TextureUVCoordinateSet> const&);
	TextureAtlasTextureItem();
	void getName() const;
	int uvCount() const;
	TextureUVCoordinateSet operator[](int) const;
};

class TilePos {
public:
	int x;
	int y;
	int z;
public:
	TilePos(const ChunkPos &, int);
	TilePos(const Vec3 &);
	TilePos(float, float, float);
};

class Vec3 {
public:
    float x;
    float y;
    float z;
public:
    Vec3(const TilePos&);
};

class AABB {
public:
    char filler[27];
	AABB(void);
	AABB(const Vec3 &, float);
	AABB(const Vec3 &, const Vec3 &);
	AABB(float, float, float, float, float, float);
	void clip(const Vec3 &, const Vec3 &) const;
	void clipXCollide(const AABB &, float) const;
	void clipYCollide(const AABB &, float) const;
	void clipZCollide(const AABB &, float) const;
	void cloneMove(const Vec3 &) const;
	bool contains(const Vec3 &) const;
	void copy() const;
	void expand(const Vec3 &);
	void expanded(float, float, float);
	void flooredCeiledCopy() const;
	void flooredCopy(float, float) const;
	void getBounds() const;
	void getSize() const;
	void grow(const Vec3 &) const;
	void intersects(const AABB &) const;
	void intersectsInner(const AABB &) const;
	bool isEmpty() const;
	bool isNan() const;
	void merge(const AABB &) const;
	void move(float, float, float);
	void set(const AABB &);
	void set(const Vec3 &, const Vec3 &);
	void set(float, float, float, float, float, float);
	void shrink(const Vec3 &);
	std::string toString() const;
	void translated(const Vec3 &) const;
};

class Material {
public:
	static Material water;
	static Material air;
	static Material leaves;
	static Material vegetable;
	static Material dirt;
	static Material lava;
	static Material replaceable_plant;
	static Material wood;
	static Material stone;
	static Material sand;
	static Material plant;
	static Material cake;
	static Material decoration;
	static Material topSnow;
	static Material cloth;
	static Material glass;
	static Material web;
	static Material metal;
	static Material ice;
	static Material snow;
	static Material clay;
	static Material fire;
	static Material sponge;
	static Material explosive;
	static Material coral;
	static Material cactus;
	static Material portal;
	static Material bed;
};

class Tile {
public:
	// inner classes
	class SoundType {
		SoundType(const std::string &, float, float);
		~SoundType();
	};
	
public:
	static Tile *netherFence, *stairs_netherBricks, *stairs_sandStone, *quartzBlock, *mycelium, *brownMushroomBlock, *redMushroomBlock, *emeraldBlock, *redStoneDust, *waterlily, *emeraldOre;
	static Tile *woodStairsJungle, *woodStairsBigOak, *woodStairsAcacia, *deadBush, *leaves2, *log2, *stairs_stoneBrickSmooth, *netherBrick, *netherrack, *ironFence, *stairs_quartz, *stainedClay;
	static Tile *pumpkin, *litPumpkin, *info_updateGame1, *carrots, *potatoes, *beetroot, *netherReactor, *glowingObsidian, *woodStairsDark, *woodStairsBirch, *hayBlock, *coalBlock, *woolCarpet;
	static Tile *stoneBrickSmooth, *fenceGateOak, *fenceGateSpruce, *fenceGateBirch, *fenceGateJungle, *fenceGateBigOak, *fenceGateAcacia, *info_updateGame2, *info_reserved6, *cobbleWall;
	static Tile *stairs_stone, *stairs_brick, *door_wood, *door_iron, *cactus, *rail, *goldenRail, *activatorRail, *melon, *pumpkinStem, *melonStem, *bed, *tallgrass, *trapdoor, *monsterStoneEgg;
	static Tile *water, *lava, *fire, *invisible_bedrock, *goldBlock, *ironBlock, *diamondBlock, *workBench, *stonecutterBench, *crops, *furnace, *furnace_lit, *chest, *lightGem, *stairs_wood, *fence;
	static Tile *redStoneOre, *redStoneOre_lit, *goldOre, *ironOre, *coalOre, *lapisOre, *lapisBlock, *reeds, *ladder, *obsidian, *tnt, *bookshelf, *sign, *wallSign, *mossStone, *torch, *mobSpawner;
	static Tile *sandStone, *sand, *stoneSlab, *stoneSlabHalf, *woodSlab, *woodSlabHalf, *cloth, *yellowFlower, *redFlower, *brownMushroom, *redMushroom, *topSnow, *log, *snow, *leaves, *diamondOre;
	static Tile *calmLava, *calmWater, *thinGlass, *web, *glass, *sponge, *sapling, *wood, *redBrick, *farmland, *clay, *ice, *grass, *podzol, *dirt, *unbreakable, *rock, *gravel, *stoneBrick, *endStone;
	static Tile *hardenedClay, *doublePlant;

	static SoundType SOUND_SILENT, SOUND_SAND, SOUND_CLOTH, SOUND_GLASS, SOUND_METAL, SOUND_STONE, SOUND_GRASS, SOUND_GRAVEL, SOUND_WOOD, SOUND_NORMAL;

	static bool shouldTick[256];
	static float translucency[256];
	static bool solid[256];
	static float lightEmission[256];
	static int lightBlock[256];
	static Tile *tiles[256];
	static TextureAtlas *_terrainTextureAtlas;
	static const char *TILE_DESCRIPTION_PREFIX;

public:
	// Size : 140
	//void **vtable;		// 0
	/*char filler1[56];					//4
	bool _replaceable;					//56
	AABB shape;			//64
	char filler0[24];
	TextureUVCoordinateSet tex;*/ //28
	char filler1[64];
	const TileID id;			//68
	const SoundType* soundType;			//72
	RenderLayer renderLayer;			//76
	bool canBuildOver;					//80
	int renderShape;					//84
	/*TileType tileType;					//88
	TileEntityType tileEntityType;		//92
	float thickness;					//96
	bool canSlide;						//100
	bool canInstatick;					//104
	float gravity;						//108
	const Material* material;			//112
	float friction;						//116
	float destroyTime;					//120
	float explosionResistance;			
	int creativeCategory;				//124
	bool fancy;							//128
	char filler2[4];		//std::shared_ptr<TextureAtlas> _terrainTextureAtlas;  //132
	unsigned int faceTextureIsotropic;	//136
	std::string descriptionId;*/			//140
	char filler4[56];
public:
	Tile(int, Material const*);
	Tile(int, TextureUVCoordinateSet, Material const*);
	Tile(int, std::string const&, Material const*);
	virtual ~Tile(); // 2
	virtual void onFertilized(TileSource*, int, int, int); // 3
	virtual void getShape(TileSource*, int, int, int, AABB&, bool); // 4
	virtual void getShape(unsigned char, AABB&, bool); // 5
	virtual bool isObstructingChests(TileSource*, int, int, int); // 6
	virtual void shouldRenderFace(TileSource*, int, int, int, signed char, AABB const&) const; // 7
	virtual TextureUVCoordinateSet& getTexture(signed char) const; // 9
	virtual TextureUVCoordinateSet& getTexture(signed char, int) const; // 10
	virtual void getTexture(TileSource*, int, int, int, signed char); // 11
	virtual void getTessellatedUVs(); // 12
	virtual void getCarriedTexture(signed char, int); // 13
